---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodRingThickness
source: html/f212d7c3-7ced-2d53-7099-287179eacf0b.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodRingThickness Property

The property labeled "Thickness (cm) of yearly growth ring" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodRingThickness { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".